Tekla.Structures.TeklaStructuresSettings.ToolOptionNames
Tool option names.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.All
The all.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Joints
The joints.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Parts
The parts.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Surfaces
The surfaces.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Points
The points.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.ConstructionLines
The construction lines.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.ReferenceModels
The reference models.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Grid
The grid.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.GridLine
The grid line.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Weldings
The weldings.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Cuts
The cuts.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Views
The views.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Screws
The screws.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.SingleScrews
The single screws.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Rebars
The rebars.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.RebarGroup
The rebar group.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.RebarSingle
The rebar single.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.PourBreaks
The pour breaks.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Planes
The planes.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Distances
The distances.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.Loads
The loads.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.AnalysisParts
The analysis parts.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.AnalysisNodes
The analysis nodes.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.AnalysisNodeLinks
The analysis node links.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.CustomObjects
The custom objects.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.ObjectsInJoints
The objects in joints.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.SelectAssemblies
The select assemblies.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.SelectObjectsInAssemblies
The select objects in assemblies.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.SelectTasks
The select tasks.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.DisplaySelectionFilterDialog
The display selection filter dialog.

Tekla.Structures.TeklaStructuresSettings.ToolOptionNames.DirectManipulation
The direct manipulation.